datasets/hcc/opendj-sdk/queries/long/653.txt

The previous version of JAXB/XJC used (2.0-b52-fcs) unmarshalls unions with a memberType="xsd:anyURI" as a java.net.URI.

The version of JAXB we're now using (2.6.6) unmarshalls them to Strings instead.

These unions are used in the DSML spec to represent attribute values:


<xsd:simpleType name="DsmlValue">
  <xsd:union memberTypes="xsd:string xsd:base64Binary xsd:anyURI"/>
</xsd:simpleType>



The following shell script causes the servlet to now pass literal URIs as values of jpegPhoto and userCertificate;binary, which is not correct.


( curl -s -X POST --data @- -H "Content-Type: text/xml" ${url} | xmllint --format - ) <<SOAP
<?xml version="1.0" encoding="UTF-8"?>
<soap-env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
 <soap-env:Body>
  <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core" requestID="modify">
   <modifyRequest dn="cn=Test User,ou=people,dc=example,dc=com">
    <modification name="description" operation="replace">
     <value>New description from DSML gateway</value>
    </modification>
    <modification name="jpegPhoto" operation="replace">
      <value xsi:type="xsd:anyURI">http://www.jpeg.org/images/green_07.jpg</value>
    </modification>
    <modification name="userCertificate;binary" operation="replace">
      <value xsi:type="xsd:anyURI">http://www.startssl.com/certs/ca.cer</value>
    </modification>
   </modifyRequest>
  </batchRequest>
 </soap-env:Body>
</soap-env:Envelope>
SOAP

